

# weather codeから文字列を返す

class Converter:
    def weatherCode(self, code):
        codeDic = {
            0: "快晴だよ!!",
            1: "晴れ時々曇りっす。",
            2: "晴れ時々曇りっす。",
            3: "晴れ時々曇りっす。",
            45: "霧がすごいんじゃ～",
            48: "霧がすごいんじゃ～",
            51: "霧雨かもね",
            53: "霧雨かもね",
            55: "霧雨かもね",
            56: "着氷性の霧雨かもね",
            57: "着氷性の霧雨かもね",
            61: "雨降ってるよん",
            63: "雨降ってるよん",
            65: "雨降ってるよん",
            66: "着氷性の雨降ってるかも。。",
            67: "着氷性の雨降ってるかも。。",
            71: "雪降ってるかもよ～",
            73: "雪降ってるかもよ～",
            75: "雪降ってるかもよ～",
            77: "雪降ってるかもよ～",
            80: "レインシャワ～",
            81: "レインシャワ～",
            82: "レインシャワ～",
            85: "結構雪降ってるね！",
            86: "結構雪降ってるね！",
            95: "雷雨かも、、、",
            96: "ひょうと雷雨だよ！",
            99: "ひょうと雷雨だよ！"
        }

        if code in codeDic:
            weather = codeDic[code]
            return weather
        else:
            return "そんなコードないよ"
